DataProcessors/ДокументооборотСКонтролирующимиОрганами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>ДокументооборотСКонтролирующимиОрганами</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

Enums/ТипыКонтролирующихОрганов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыКонтролирующихОрганов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ФНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПФР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФСС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФСГС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФСРАР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РПН</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УдалитьБанкРоссии</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФТС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Роструд</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Минобороны</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ФАС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Минюст</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РЭЦ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РегистрацияЮЛФНС</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЦПРР</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Роскомнадзор</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МВД</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Минпромторг</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СпецоператорыСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СпецоператорыСвязи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>КалугаАстрал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Такском</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Прочие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Форус</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ТипыЗаявленияАбонентаСпецоператораСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ТипыЗаявленияАбонентаСпецоператораСвязи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Первичное</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Изменение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Пролонгация</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Восстановление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыОбменаСКонтролирующимиОрганами.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыОбменаСКонтролирующимиОрганами</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ОбменОтключен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменВУниверсальномФормате</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбменЧерезСпринтер</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/СтатусыЗаявленияАбонентаСпецоператораСвязи.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>СтатусыЗаявленияАбонентаСпецоператораСвязи</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Подготовлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отправлено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Одобрено</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отклонено</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

Enums/ВидыЗаявленийНаЭДОВПФР.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Enum>
		<Properties>
			<Name>ВидыЗаявленийНаЭДОВПФР</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаПодключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаОтключение</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаСертификат</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

DataProcessors/ДокументооборотСКонтролирующимиОрганами/Forms/НастройкиОбмена/Ext/Form/Module.bsl
&НаКлиенте
Перем КонтекстЭДОКлиент Экспорт;

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Организация = Параметры.Организация;
	
	ИспользуетсяОднаОрганизация = РегламентированнаяОтчетностьВызовСервера.ИспользуетсяОднаОрганизация();
	ДоступнаЭлектроннаяПодписьВМоделиСервиса = ЭлектроннаяПодписьВМоделиСервиса.ИспользованиеВозможно();
	ЗаявленияПоЭДООтправляютсяВПФР = ДокументооборотСКОВызовСервера.ЗаявленияПоЭДООтправляютсяВПФР();
	
	ЦветУспеха 		= ЦветаСтиля.ЦветУспешнойОтправкиБРО;
	ЦветОшибки 		= ЦветаСтиля.ЦветОшибкиВПротоколеБРО;
	ЦветНеактивного = ЦветаСтиля.ЦветШрифтаНенаступившегоЭтапа;
	
	Элементы.ГруппаЗаявление.Видимость 								= Ложь;
	Элементы.ОбновитьСостояние.Видимость 							= Ложь;
	Элементы.ГруппаПодключение.Видимость 							= Ложь;
	Элементы.ГруппаРазделительШапки.Видимость 						= Ложь;
	Элементы.ГруппаШапка.Видимость 									= Ложь;
	Элементы.ГруппаРазделительКонтролирующиеОрганы.Видимость 		= Ложь;
	Элементы.ОтборПоПользователю.Видимость 					= Ложь;
	Элементы.ГруппаКонтролирующиеОрганы.Видимость 					= Ложь;
	Элементы.ГруппаРазделительПрочихНастроек.Видимость 				= Ложь;
	Элементы.ГруппаПрочиеНастройки.Видимость 						= Ложь;
	Элементы.СообщенияДляРасшифровкиДругимиПользователями.Видимость = Ложь;
	
	ИзменитьОформлениеОбновитьССервера(ЭтотОбъект, Истина);
	
	ОтборПоПользователю = Справочники.Пользователи.ПустаяСсылка();
	ИнициализироватьМультирежим();
	
	ПриСозданииНаСервере_85();
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ПриОткрытииПослеПолученияКонтекстаЭДО", ЭтотОбъект);
	ДокументооборотСКОКлиент.ПолучитьКонтекстЭДО(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если (ИмяСобытия = РегламентированнаяОтчетностьКлиент.ИмяСобытияЗавершениеОтправки() ИЛИ ИмяСобытия = "Успешная отправка заявления на переход")
			И ТипЗнч(Параметр) = Тип("Структура") И Параметр.Свойство("Организация")
			И ТипЗнч(Параметр.Организация) = Тип("СправочникСсылка.Организации") И Параметр.Организация = Организация
		ИЛИ ИмяСобытия = "Завершение отправки заявления"
		ИЛИ ИмяСобытия = "Запись_Организации" И ТипЗнч(Источник) = Тип("СправочникСсылка.Организации") И Источник = Организация
		ИЛИ ИмяСобытия = "ИзмененаРегистрацияВНалоговомОргане" И ТипЗнч(Параметр) = Тип("Структура")
			И Параметр.Свойство("Владелец") И ТипЗнч(Параметр.Владелец) = Тип("СправочникСсылка.Организации")
			И Параметр.Владелец = Организация
		ИЛИ ИмяСобытия = "ИзменениеНастроекЭДООрганизации" И ТипЗнч(Параметр) = Тип("СправочникСсылка.Организации")
			И Параметр = Организация
		ИЛИ ИмяСобытия = "ЗаполнитьСводнуюИнформациюПоЗаявлениюАбонентаСпецоператораСвязи"
		ИЛИ ИмяСобытия = "ОбновитьУчетнуюЗапись" ИЛИ ИмяСобытия = "Изменены пользователи учетной записи" 
		ИЛИ ИмяСобытия = "ИзменилисьНастройкиПодтвержденияСМС" Тогда
		
		ОбновитьНастройкиОбменаОрганизации();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ОбменСФНСОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	ГосОрганНажатие(СтандартнаяОбработка, ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ФНС"));

КонецПроцедуры

&НаКлиенте
Процедура ОбменСРосстатомОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)

	ГосОрганНажатие(СтандартнаяОбработка, ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ФСГС"));

КонецПроцедуры

&НаКлиенте
Процедура ОбменСПФРОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "Подсказка" Тогда
		ДокументооборотСКОКлиент.ПоказатьПодсказку(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	Иначе
		ГосОрганНажатие(СтандартнаяОбработка, ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ПФР"));
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ОбменСФССОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ГосОрганНажатие(СтандартнаяОбработка, ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ФСС"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменСФСРАРОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ГосОрганНажатие(СтандартнаяОбработка, ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ФСРАР"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменСРПНОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ГосОрганНажатие(СтандартнаяОбработка, ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.РПН"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменСФТСОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ГосОрганНажатие(СтандартнаяОбработка, ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ФТС"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменСБанкомРоссииОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	Если НавигационнаяСсылкаФорматированнойСтроки = "Подсказка" Тогда
		ДокументооборотСКОКлиент.ПоказатьПодсказку(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка);
	Иначе
		ГосОрганНажатие(СтандартнаяОбработка, ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.ЦБ"));
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбменСМинобороныОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	ГосОрганНажатие(СтандартнаяОбработка, ПредопределенноеЗначение("Перечисление.ТипыКонтролирующихОрганов.Минобороны"));
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьССервера(Команда)
	
	Если КонтекстЭДОКлиент = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибкиИнициализацииКонтекстаЭДО);
		Возврат;
	КонецЕсли;
	
	УчетнаяЗаписьДоступна = УчетнаяЗаписьДоступна(ЭтотОбъект);
	
	Если НЕ УчетнаяЗаписьДоступна ИЛИ НЕ ЗначениеЗаполнено(ЭлементНастроекОбмена.СпецоператорСвязи)
		ИЛИ ЭлементНастроекОбмена.СпецоператорСвязи = ПредопределенноеЗначение("Перечисление.СпецоператорыСвязи.Прочие") Тогда
		Возврат;
	КонецЕсли;
	
	ОписаниеОповещения = Новый ОписаниеОповещения("НастроитьАвтоматическиСейчасНажатиеПослеАвтонастройки", ЭтотОбъект);
	КонтекстЭДОКлиент.АвтоматическаяНастройкаУчетнойЗаписи(
		ЭлементНастроекОбмена.УчетнаяЗаписьОбмена,,
		ОписаниеОповещения,,
		Истина);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ЗаявлениеНаПодключениеНажатие(Элемент)
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьФормуМастераЗаявленияНаПодключение(
		Организация,
		ЭтотОбъект,,
		ПредопределенноеЗначение("Перечисление.ТипыЗаявленияАбонентаСпецоператораСвязи.Первичное"));
	
КонецПроцедуры

&НаКлиенте
Процедура СостояниеПоследнегоЗаявленияНажатие(Элемент)
	
	Если КонтекстЭДОКлиент = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибкиИнициализацииКонтекстаЭДО);
		Возврат;
	КонецЕсли;
	
	КонтекстЭДОКлиент.ПоказатьФормуСтатусовОтправкиИлиОбновитьЗаявление(
		ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_Ссылка,
		ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_Статус,
		ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_НастройкаЗавершена,
		ЭлементНастроекОбмена.Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСостояние(Команда)
	
	Если КонтекстЭДОКлиент = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибкиИнициализацииКонтекстаЭДО);
		Возврат;
	КонецЕсли;
	
	КонтекстЭДОКлиент.ПоказатьФормуСтатусовОтправкиИлиОбновитьЗаявление(
		ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_Ссылка,,,
		ЭлементНастроекОбмена.Организация,
		Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура ОтборПоПользователюПриИзменении(Элемент)
	
	ОбновитьНастройкиОбменаОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаявлениеНаИзменениеНажатие(Элемент)
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьФормуМастераЗаявленияНаПодключение(
		Организация,
		ЭтотОбъект,,
		ПредопределенноеЗначение("Перечисление.ТипыЗаявленияАбонентаСпецоператораСвязи.Изменение"));
	
КонецПроцедуры

&НаКлиенте
Процедура ВосстановлениеУчетнойЗаписиНажатие(Элемент)
	
	ЭтоУчетнаяЗаписьТакском = (ЭлементНастроекОбмена.ВидОбменаСКонтролирующимиОрганами =
		ПредопределенноеЗначение("Перечисление.ВидыОбменаСКонтролирующимиОрганами.ОбменВУниверсальномФормате")
		И ЗначениеЗаполнено(ЭлементНастроекОбмена.УчетнаяЗаписьОбмена)
		И ЭлементНастроекОбмена.ПравоЧтенияУчетнойЗаписиОбмена
		И ЭлементНастроекОбмена.СпецоператорСвязи = ПредопределенноеЗначение("Перечисление.СпецоператорыСвязи.Такском"));
	
	СписокВариантов = Новый СписокЗначений;
	
	СписокВариантов.Добавить(ПредопределенноеЗначение("Перечисление.СпецоператорыСвязи.ПустаяСсылка"),
		НСтр("ru = '1С-Отчетность'"));
	СписокВариантов.Добавить(ПредопределенноеЗначение("Перечисление.СпецоператорыСвязи.Такском"),
		НСтр("ru = '1С-Спринтер (""Такском"")'"));
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВосстановлениеУчетнойЗаписиНажатиеПослеВыбора",
		ЭтотОбъект);
	СписокВариантов.ПоказатьВыборЭлемента(
		ОписаниеОповещения,
		НСтр("ru = 'Восстановление учетной записи'"),
		?(ЭтоУчетнаяЗаписьТакском, СписокВариантов[1], СписокВариантов[0]));
		
КонецПроцедуры

&НаКлиенте
Процедура СписокЗаявленийНажатие(Элемент)
	
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьФормуСпискаЗаявленийНаПодключение(Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура РасширенныеНастройкиНажатие(Элемент)
	
	Если КонтекстЭДОКлиент = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибкиИнициализацииКонтекстаЭДО);
		Возврат;
	КонецЕсли;
	
	КонтекстЭДОКлиент.ОткрытьФормуРасширенныхНастроек(Организация);
	
КонецПроцедуры

&НаКлиенте
Процедура СообщенияДляРасшифровкиДругимиПользователямиНажатие(Элемент)
	
	ПараметрыПоказа = КонтекстЭДОКлиент.ПараметрыПоказаСообщенийТребующихРасшифровки();
	ПараметрыПоказа.ПоказДляТекущегоПользователя 	= Ложь;
	ПараметрыПоказа.ПоказДляДругихПользователей 	= Истина;
	ПараметрыПоказа.ВсеСообщения 					= Истина;
	ПараметрыПоказа.Организация 					= Организация;
	
	ВходящиеСообщения = КонтекстЭДОКлиент.ПолучитьИОбработатьВходящие(УникальныйИдентификатор, ПараметрыПоказа);
	
	// оповещаем открытые формы
	Если ВходящиеСообщения <> Неопределено И ВходящиеСообщения.НовыеСообщения.Количество() > 0 Тогда
		Оповестить("Заполнение списка полученных сообщений", ВходящиеСообщения.НовыеСообщения);
	КонецЕсли;
	
	// выводим диалог
	Если ВходящиеСообщения <> Неопределено И ВходящиеСообщения.ТребующиеРасшифровки.Количество() > 0
		И КонтекстЭДОКлиент.ВыполнитьРасшифровкуПриНеобходимости(ВходящиеСообщения.ТребующиеРасшифровки,
		ПараметрыПоказа) Тогда
		
		Возврат;
	КонецЕсли;
	
	ПоказатьПредупреждение(, НСтр("ru = 'Нет нерасшифрованных сообщений для других пользователей.'"));
	
КонецПроцедуры

&НаКлиенте
Процедура СписокПользователейНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	УчетнаяЗаписьДоступна = УчетнаяЗаписьДоступна(ЭтотОбъект);
	
	Если УчетнаяЗаписьДоступна Тогда
		Если ЭлементНастроекОбмена.ЭтоМультиРежим Тогда
			МультирежимКлиент.ОткрытьПраваПользователей(ЭтотОбъект);
			
		Иначе
			СписокПользователейКопия = ЭлементНастроекОбмена.СписокПользователей.Скопировать();
			
			ОписаниеОповещения = Новый ОписаниеОповещения("СписокПользователейОбработкаНавигационнойСсылкиПослеПоказаСпискаПользователей",
				ЭтотОбъект);
			
			КонтекстЭДОКлиент.ОткрытьФормуСпискаПользователей(ОписаниеОповещения, СписокПользователейКопия);
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура СпособПодтвержденияКриптооперацийНажатие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка 	= Ложь;
	ПараметрыФормы			= Новый Структура("ЦиклКриптооперации", Ложь);
	ОбработкаИзменения		= Новый ОписаниеОповещения("ПослеИзмененияПодтвержденияСМС", ЭтотОбъект);
	ЭлектроннаяПодписьВМоделиСервисаКлиент.ИзменитьСпособПодтвержденияКриптоопераций(ЭлементНастроекОбмена.СвойстваСертификатаРуководителя, ОбработкаИзменения, ПараметрыФормы);

КонецПроцедуры

&НаКлиенте
Процедура СрокДействияСертификатаОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытияМастера = Новый Структура("ПриОткрытииЗапрошеноПродлениеСертификата, ПриОткрытииЗапрошеноПродлениеЛицензии",
		Истина, ЛицензияТребуетПродления);
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьФормуМастераЗаявленияНаПодключение(
		ЭлементНастроекОбмена.Организация,
		ЭтотОбъект,,,
		ПараметрыОткрытияМастера);
		
КонецПроцедуры

&НаКлиенте
Процедура СрокДействияЛицензииОбработкаНавигационнойСсылки(Элемент, НавигационнаяСсылкаФорматированнойСтроки, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ПараметрыОткрытияМастера = Новый Структура("ПриОткрытииЗапрошеноПродлениеСертификата, ПриОткрытииЗапрошеноПродлениеЛицензии",
		СертификатТребуетПродления, Истина);
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиент.ОткрытьФормуМастераЗаявленияНаПодключение(
		ЭлементНастроекОбмена.Организация,
		ЭтотОбъект,,,
		ПараметрыОткрытияМастера);
	
КонецПроцедуры
	
#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаКлиенте
Процедура ПриОткрытииПослеПолученияКонтекстаЭДО(Результат, ДополнительныеПараметры) Экспорт
	
	КонтекстЭДОКлиент = Результат.КонтекстЭДО;
	ЭтоИнициализация = Истина;
	ОбновитьНастройкиОбменаОрганизации();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройкиОбменаОрганизации(ОповещениеОЗавершении = Неопределено) Экспорт
	
	Если КонтекстЭДОКлиент = Неопределено Тогда
		ЭтоИнициализация = Ложь;
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибкиИнициализацииКонтекстаЭДО);
		Возврат;
	КонецЕсли;
	
	ДополнительныеПараметры = Новый Структура("ОповещениеОЗавершении", ОповещениеОЗавершении);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбновитьНастройкиОбменаОрганизацииПослеПолученияНастроекОбмена",
		ЭтотОбъект, ДополнительныеПараметры);
	НастройкиВызова = Новый Структура;
	НастройкиВызова.Вставить("ПолучатьПоддерживаемыеНаправленияДляОператоров", Ложь);
	Если ЭтоМультиРежим Тогда
		НастройкиВызова.Вставить("ОтборПоПользователю", ОтборПоПользователю);
	КонецЕсли;
	КонтекстЭДОКлиент.НастройкиОбменаОрганизаций(ОписаниеОповещения, Организация, НастройкиВызова);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьНастройкиОбменаОрганизацииПослеПолученияНастроекОбмена(Результат, ДополнительныеПараметры) Экспорт
	
	ОповещениеОЗавершении = ДополнительныеПараметры.ОповещениеОЗавершении;
	
	СрокиПредупреждений = КонтекстЭДОКлиент.СрокиПредупрежденийНастроекОбменов(Результат.ТекущаяДатаНаСервере);
	
	ТекущаяДатаОкончанияПоказаЗаявления = СрокиПредупреждений.ТекущаяДатаОкончанияПоказаЗаявления;
	ТекущаяДатаИстечения 				= СрокиПредупреждений.ТекущаяДатаИстечения;
	
	ЭлементНастроекОбмена = Результат.НастройкиОбмена[0];
	
	УчетнаяЗаписьДоступна = УчетнаяЗаписьДоступна(ЭтотОбъект);
	
	Если УчетнаяЗаписьДоступна И НЕ ЭтоИнициализация Тогда
		ИнициализироватьМультирежим();
	КонецЕсли;
	ЭтоИнициализация = Ложь;
	
	ПоддерживаетсяВторичноеЗаявление = (УчетнаяЗаписьДоступна
		И ЗначениеЗаполнено(ЭлементНастроекОбмена.СпецоператорСвязи)
		И ЭлементНастроекОбмена.СпецоператорСвязи <> ПредопределенноеЗначение("Перечисление.СпецоператорыСвязи.Такском")
		И ЭлементНастроекОбмена.СпецоператорСвязи <> ПредопределенноеЗначение("Перечисление.СпецоператорыСвязи.Прочие"));
	
	НаименованиеОрганизации = ?(ЗначениеЗаполнено(ЭлементНастроекОбмена.НаименованиеСокращенное),
		ЭлементНастроекОбмена.НаименованиеСокращенное, ЭлементНастроекОбмена.НаименованиеОрганизации);
	ЭлектронныйДокументооборотСКонтролирующимиОрганамиКлиентСервер.ДобавитьОрганизациюВЗаголовок(
		ЭтотОбъект.Заголовок,
		ИспользуетсяОднаОрганизация,
		НаименованиеОрганизации,
		НСтр("ru = 'Настройки обмена с контролирующими органами'"));
	
	Элементы.ОтборПоПользователю.Видимость = ЭтоМультиРежим И ВладелецЭЦПЭтоАдмин;
	
	Элементы.ТекстИнформацииПодключение.Видимость = НЕ ЗначениеЗаполнено(ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_Ссылка)
		ИЛИ ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_ТипЗаявления =
		ПредопределенноеЗначение("Перечисление.ТипыЗаявленияАбонентаСпецоператораСвязи.Первичное");
	Элементы.ТекстИнформацииИзменение.Видимость = ЗначениеЗаполнено(ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_Ссылка)
		И ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_ТипЗаявления <>
		ПредопределенноеЗначение("Перечисление.ТипыЗаявленияАбонентаСпецоператораСвязи.Первичное");
	
	ИнформацияОСтатусеЗаявления = КонтекстЭДОКлиент.СтатусЗаявленияСтрокой(
		ЭлементНастроекОбмена,
		ЦветУспеха,
		ЦветОшибки,
		ЦветНеактивного,
		Ложь);
		
	Если ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_ТипЗаявления =
		ПредопределенноеЗначение("Перечисление.ТипыЗаявленияАбонентаСпецоператораСвязи.Первичное") Тогда
		ЗаявлениеТекст = СтрШаблон(
			НСтр("ru = 'Заявление на подключение %1'"),
			ИнформацияОСтатусеЗаявления.СтатусСтрокой);
	Иначе
		ЗаявлениеТекст = СтрШаблон(
			НСтр("ru = 'Заявление на изменение %1'"),
			ИнформацияОСтатусеЗаявления.СтатусСтрокой);
	КонецЕсли;
	Если (ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_Статус =
		ПредопределенноеЗначение("Перечисление.СтатусыЗаявленияАбонентаСпецоператораСвязи.Отклонено")
		ИЛИ ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_Статус =
		ПредопределенноеЗначение("Перечисление.СтатусыЗаявленияАбонентаСпецоператораСвязи.Одобрено"))
		И НЕ ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_НастройкаЗавершена Тогда
		ПерваяБукваТекста = Лев(ЗаявлениеТекст, 1);
		ЗаявлениеТекст = нрег(ПерваяБукваТекста) + Сред(ЗаявлениеТекст, 2);
		ЗаявлениеТекст = СтрШаблон(
			НСтр("ru = 'Настроить 1С-Отчетность (%1)'"),
			ЗаявлениеТекст);
	КонецЕсли;
	Элементы.СостояниеПоследнегоЗаявления.Заголовок = ЗаявлениеТекст;
	Элементы.СостояниеПоследнегоЗаявления.ЦветТекста = ?(ИнформацияОСтатусеЗаявления.ЦветСтатуса <> Неопределено,
		ИнформацияОСтатусеЗаявления.ЦветСтатуса, Новый Цвет);
	Если ИнформацияОСтатусеЗаявления.ВыделениеНезавершенного Тогда
		Элементы.СостояниеПоследнегоЗаявления.Шрифт = Новый Шрифт(Элементы.СостояниеПоследнегоЗаявления.Шрифт,,, Истина);
	КонецЕсли;
	Элементы.ОбновитьСостояние.Видимость = (ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_Статус =
		ПредопределенноеЗначение("Перечисление.СтатусыЗаявленияАбонентаСпецоператораСвязи.Отправлено"));
	Элементы.ПричинаОтклоненияПоследнегоЗаявления.Заголовок =
		ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_СтатусКомментарий;
	Элементы.ПричинаОтклоненияПоследнегоЗаявления.Подсказка =
		ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_СтатусКомментарий;
	Элементы.ГруппаПричина.Видимость = ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_Статус =
		ПредопределенноеЗначение("Перечисление.СтатусыЗаявленияАбонентаСпецоператораСвязи.Отклонено")
		И ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_НастройкаЗавершена;
	ОтображениеСостоянияЗаявления = ЗначениеЗаполнено(ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_Ссылка)
		И (ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_Статус =
		ПредопределенноеЗначение("Перечисление.СтатусыЗаявленияАбонентаСпецоператораСвязи.Подготовлено")
		ИЛИ ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_Статус =
		ПредопределенноеЗначение("Перечисление.СтатусыЗаявленияАбонентаСпецоператораСвязи.Отправлено")
		ИЛИ ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_Статус =
		ПредопределенноеЗначение("Перечисление.СтатусыЗаявленияАбонентаСпецоператораСвязи.Одобрено")
		И НЕ ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_НастройкаЗавершена
		ИЛИ ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_Статус =
		ПредопределенноеЗначение("Перечисление.СтатусыЗаявленияАбонентаСпецоператораСвязи.Отклонено"))
		И ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_Дата <> Неопределено
		И ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_Дата >= ТекущаяДатаОкончанияПоказаЗаявления;
	РазрешеноПодключение = НЕ УчетнаяЗаписьДоступна И (НЕ ОтображениеСостоянияЗаявления
		ИЛИ (ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_Статус =
		ПредопределенноеЗначение("Перечисление.СтатусыЗаявленияАбонентаСпецоператораСвязи.Отклонено")
		И ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_НастройкаЗавершена));
	
	Элементы.ГруппаЗаявление.Видимость 							= ОтображениеСостоянияЗаявления;
	Элементы.ГруппаРазделительПодключение.Видимость 			= ОтображениеСостоянияЗаявления И РазрешеноПодключение;
	Элементы.ГруппаПодключение.Видимость 						= РазрешеноПодключение;
	
	ОператорЭлектронногоДокументооборота = ?(ЗначениеЗаполнено(ЭлементНастроекОбмена.НаименованиеОператора),
		ЭлементНастроекОбмена.НаименованиеОператора, НСтр("ru = 'Отсутствует'"));
	
	Если ЭлементНастроекОбмена.СвойстваСертификатаРуководителя = Неопределено Тогда
		Если НЕ ЗначениеЗаполнено(ЭлементНастроекОбмена.СертификатРуководителя) И ЭлементНастроекОбмена.ЭтоМультиРежим Тогда
			СертификатТребуетПродления = Истина;
			
			СрокДействияСертификата = Новый ФорматированнаяСтрока(
				НСтр("ru = 'Отсутствует'"),,
				ЦветОшибки);
				
			Если ПоддерживаетсяВторичноеЗаявление Тогда
					
				СтрокаПродлитьСертификат = Новый ФорматированнаяСтрока(
					НСтр("ru = 'Подключиться к 1С-Отчетности'"),,,,
					"Сертификат");
					
				СрокДействияСертификата = Новый ФорматированнаяСтрока(СрокДействияСертификата, " ", СтрокаПродлитьСертификат);
				
			КонецЕсли;
			
		Иначе
			СертификатТребуетПродления = Ложь;
			СрокДействияСертификата = Новый ФорматированнаяСтрока(
				НСтр("ru = 'Недоступен'"),,
				ЦветОшибки);
		КонецЕсли;
	Иначе
		ИнформацияОСтатусеСертификата = КонтекстЭДОКлиент.СтатусДействительностиСтрокой(
			ЭлементНастроекОбмена.СвойстваСертификатаРуководителя.ДействителенПо,
			Результат.ТекущаяДатаНаСервере,
			ТекущаяДатаИстечения,
			Истина,
			ЦветОшибки,
			Истина);
		СертификатТребуетПродления = ИнформацияОСтатусеСертификата.ТребуетПродления;
		СрокДействияСертификата = Новый ФорматированнаяСтрока(
			ИнформацияОСтатусеСертификата.СтатусСтрокой,,
			ИнформацияОСтатусеСертификата.ЦветСтатуса);
			
		Если ПоддерживаетсяВторичноеЗаявление И СертификатТребуетПродления Тогда
					
			СтрокаПродлитьСертификат = Новый ФорматированнаяСтрока(
				НСтр("ru = 'Продлить'"),,,,
				"Продлить");
				
			СрокДействияСертификата = Новый ФорматированнаяСтрока(СрокДействияСертификата, " ", СтрокаПродлитьСертификат);
				
		КонецЕсли;
			
	КонецЕсли;
	
	ИнформацияОСтатусеЛицензии = КонтекстЭДОКлиент.СтатусДействительностиСтрокой(
		ЭлементНастроекОбмена.ЛицензияДатаОкончания,
		Результат.ТекущаяДатаНаСервере,
		ТекущаяДатаИстечения,
		Ложь,
		ЦветОшибки,
		Истина,
		ЭлементНастроекОбмена.ЛицензияНаименование);
	ЛицензияТребуетПродления = ИнформацияОСтатусеЛицензии.ТребуетПродления;
	
	СрокДействияЛицензии = Новый ФорматированнаяСтрока(
		ИнформацияОСтатусеЛицензии.СтатусСтрокой,,
		ИнформацияОСтатусеЛицензии.ЦветСтатуса);
		
	Если ЛицензияТребуетПродления И ПоддерживаетсяВторичноеЗаявление Тогда
			
		СтрокаПродлитьЛицензию = Новый ФорматированнаяСтрока(
			НСтр("ru = 'Продлить'"),,,,
			"Продлить");
				
		СрокДействияЛицензии = Новый ФорматированнаяСтрока(СрокДействияЛицензии, " ", СтрокаПродлитьЛицензию);
	КонецЕсли;
	
	ЕстьСертификатИлиУчетнаяЗапись = ЗначениеЗаполнено(ЭлементНастроекОбмена.СертификатРуководителя)
		ИЛИ ЭлементНастроекОбмена.ЭтоМультиРежим;
	
	Элементы.ГруппаРазделительШапки.Видимость 	= ОтображениеСостоянияЗаявления И УчетнаяЗаписьДоступна;
	Элементы.ОператорЭлектронногоДокументооборота.Видимость = НЕ ПоддерживаетсяВторичноеЗаявление;
	Элементы.СрокДействияСертификата.Видимость 	= ЕстьСертификатИлиУчетнаяЗапись;
	Элементы.СрокДействияЛицензии.Видимость 	= ЗначениеЗаполнено(ЭлементНастроекОбмена.ЛицензияДатаОкончания);
	Элементы.ГруппаШапка.Видимость 				= УчетнаяЗаписьДоступна;
	
	ОбновитьСписокПользователей();
	
	// Контролирующие органы
	
	КонтролирующиеОрганыМаксимальноеКоличествоСтрок = 3;
	ФНСПФРРосстатКоличествоСтрок =
		?(ЭлементНастроекОбмена.ПризнакПоддержкиФНС
		ИЛИ ЭлементНастроекОбмена.ПредназначенаДляДокументооборотаСФНС, 1, 0)
		+ ?(ЭлементНастроекОбмена.ПризнакПоддержкиПФР
		ИЛИ ЭлементНастроекОбмена.ПредназначенаДляДокументооборотаСПФР, 1, 0)
		+ ?(ЭлементНастроекОбмена.ПризнакПоддержкиФСГС
		ИЛИ ЭлементНастроекОбмена.ПредназначенаДляДокументооборотаСФСГС, 1, 0);
	КоличествоФНС = ЭлементНастроекОбмена.КодыФНС.Количество();
	КоличествоФСГС = ЭлементНастроекОбмена.КодыФСГС.Количество();
	Если ЭлементНастроекОбмена.ПредназначенаДляДокументооборотаСФНС Тогда
		Если КоличествоФНС > 1 Тогда
			ФНССтрокой = СтрШаблон(
				НСтр("ru = 'Подключено (%1)'"),
				Строка(КоличествоФНС));
		Иначе
			ФНССтрокой = НСтр("ru = 'Подключено'");
		КонецЕсли;
	Иначе
		ФНССтрокой = НСтр("ru = 'Не подключено'");
	КонецЕсли;
	Элементы.ГруппаРазделительКонтролирующиеОрганы.Видимость = Истина;
	Элементы.ГруппаКонтролирующиеОрганы.Видимость = Истина;
	Элементы.ОбменСФНС.Видимость = ЭлементНастроекОбмена.ПризнакПоддержкиФНС
		ИЛИ ЭлементНастроекОбмена.ПредназначенаДляДокументооборотаСФНС;
	ОбменСФНС = Новый ФорматированнаяСтрока(
		ФНССтрокой,,
		?(ЭлементНастроекОбмена.ПредназначенаДляДокументооборотаСФНС, ЦветУспеха, ЦветНеактивного),,
		"ФНС");
	
	Элементы.ОбменСПФР.Видимость = ЭлементНастроекОбмена.ПризнакПоддержкиПФР
		ИЛИ ЭлементНастроекОбмена.ПредназначенаДляДокументооборотаСПФР;
		
	Если ЗаявленияПоЭДООтправляютсяВПФР И ЭлементНастроекОбмена.ПредназначенаДляДокументооборотаСПФР Тогда
		
		СостояниеЭДОсПФР = ЭлементНастроекОбмена.СостояниеЭДОсПФР;
		УстановитьЗаголовокОбменаСПФР(СостояниеЭДОсПФР, ЦветУспеха, ЦветОшибки);
		
	Иначе
		
		Надпись = ?(ЭлементНастроекОбмена.ПредназначенаДляДокументооборотаСПФР, НСтр("ru = 'Подключено'"), НСтр("ru = 'Не подключено'"));
		Цвет = ?(ЭлементНастроекОбмена.ПредназначенаДляДокументооборотаСПФР, ЦветУспеха, ЦветНеактивного);
		
		ОбменСПФР = Новый ФорматированнаяСтрока(Надпись,, Цвет,, "ПФР");
		
	КонецЕсли;
	
	Если ЭлементНастроекОбмена.ПредназначенаДляДокументооборотаСФСГС Тогда
		Если КоличествоФСГС > 1 Тогда
			РосстатСтрокой = СтрШаблон(
				НСтр("ru = 'Подключено (%1)'"),
				Строка(КоличествоФСГС));
		Иначе
			РосстатСтрокой = НСтр("ru = 'Подключено'");
		КонецЕсли;
	Иначе
		РосстатСтрокой = НСтр("ru = 'Не подключено'");
	КонецЕсли;
	Элементы.ОбменСРосстатом.Видимость = ЭлементНастроекОбмена.ПризнакПоддержкиФСГС
		ИЛИ ЭлементНастроекОбмена.ПредназначенаДляДокументооборотаСФСГС;
	ОбменСРосстатом = Новый ФорматированнаяСтрока(
		РосстатСтрокой,,
		?(ЭлементНастроекОбмена.ПредназначенаДляДокументооборотаСФСГС, ЦветУспеха, ЦветНеактивного),,
		"Росстат");
		
	Элементы.ГруппаОбменСФНСПФРРосстатом.Видимость = ЭлементНастроекОбмена.ПризнакПоддержкиФНС
		ИЛИ ЭлементНастроекОбмена.ПредназначенаДляДокументооборотаСФНС
		ИЛИ ЭлементНастроекОбмена.ПризнакПоддержкиПФР
		ИЛИ ЭлементНастроекОбмена.ПредназначенаДляДокументооборотаСПФР
		ИЛИ ЭлементНастроекОбмена.ПризнакПоддержкиФСГС
		ИЛИ ЭлементНастроекОбмена.ПредназначенаДляДокументооборотаСФСГС;
	
	ФССФСРАРРПНКоличествоСтрок =
		?(ЭлементНастроекОбмена.ПризнакПоддержкиФСС
		ИЛИ ЭлементНастроекОбмена.НастройкиОбменаФСС_ИспользоватьОбмен, 1, 0)
		+ ?(ЭлементНастроекОбмена.ПризнакПоддержкиФСРАР
		ИЛИ ЭлементНастроекОбмена.НастройкиОбменаФСРАР_ИспользоватьОбмен, 1, 0)
		+ ?(ЭлементНастроекОбмена.ПризнакПоддержкиРПН
		ИЛИ ЭлементНастроекОбмена.НастройкиОбменаРПН_ИспользоватьОбмен, 1, 0);
	Элементы.ОбменСФСС.Видимость = ЭлементНастроекОбмена.ПризнакПоддержкиФСС
		ИЛИ ЭлементНастроекОбмена.НастройкиОбменаФСС_ИспользоватьОбмен;
	ОбменСФСС = Новый ФорматированнаяСтрока(
		?(ЭлементНастроекОбмена.НастройкиОбменаФСС_ИспользоватьОбмен, НСтр("ru = 'Подключено'"), НСтр("ru = 'Не подключено'")),,
		?(ЭлементНастроекОбмена.НастройкиОбменаФСС_ИспользоватьОбмен, ЦветУспеха, ЦветНеактивного),,
		"ФСС");
	
	Элементы.ОбменСФСРАР.Видимость = ЭлементНастроекОбмена.ПризнакПоддержкиФСРАР
		ИЛИ ЭлементНастроекОбмена.НастройкиОбменаФСРАР_ИспользоватьОбмен;
	ОбменСФСРАР = Новый ФорматированнаяСтрока(
		?(ЭлементНастроекОбмена.НастройкиОбменаФСРАР_ИспользоватьОбмен, НСтр("ru = 'Подключено'"), НСтр("ru = 'Не подключено'")),,
		?(ЭлементНастроекОбмена.НастройкиОбменаФСРАР_ИспользоватьОбмен, ЦветУспеха, ЦветНеактивного),,
		"ФСРАР");
		
	Элементы.ОбменСРПН.Видимость = ЭлементНастроекОбмена.ПризнакПоддержкиРПН
		ИЛИ ЭлементНастроекОбмена.НастройкиОбменаРПН_ИспользоватьОбмен;
	ОбменСРПН = Новый ФорматированнаяСтрока(
		?(ЭлементНастроекОбмена.НастройкиОбменаРПН_ИспользоватьОбмен, НСтр("ru = 'Подключено'"), НСтр("ru = 'Не подключено'")),,
		?(ЭлементНастроекОбмена.НастройкиОбменаРПН_ИспользоватьОбмен, ЦветУспеха, ЦветНеактивного),,
		"РПН");
	Элементы.ГруппаОбменСФССФСРАРРПН.Видимость = ЭлементНастроекОбмена.ПризнакПоддержкиФСС
		ИЛИ ЭлементНастроекОбмена.НастройкиОбменаФСС_ИспользоватьОбмен
		ИЛИ ЭлементНастроекОбмена.ПризнакПоддержкиФСРАР
		ИЛИ ЭлементНастроекОбмена.НастройкиОбменаФСРАР_ИспользоватьОбмен
		ИЛИ ЭлементНастроекОбмена.ПризнакПоддержкиРПН
		ИЛИ ЭлементНастроекОбмена.НастройкиОбменаРПН_ИспользоватьОбмен;
	
	ФТСБанкРоссииМОКоличествоСтрок =
		?(ЭлементНастроекОбмена.ПризнакПоддержкиФТС
		ИЛИ ЭлементНастроекОбмена.НастройкиОбменаФТС_ИспользоватьОбмен, 1, 0)
		+ ?(ЭлементНастроекОбмена.ПризнакПоддержкиЦБ
		ИЛИ ЭлементНастроекОбмена.ПредназначенаДляДокументооборотаСЦБ, 1, 0)
		+ ?(Результат.ПоддерживаетсяСдачаОтчетностиВМинобороныРоссии, 1, 0);
	КонтролирующиеОрганыКоличествоСтрок = ?(ФНСПФРРосстатКоличествоСтрок >= ФССФСРАРРПНКоличествоСтрок,
		ФНСПФРРосстатКоличествоСтрок, ФССФСРАРРПНКоличествоСтрок);
	КонтролирующиеОрганыКоличествоСтрок = ?(КонтролирующиеОрганыКоличествоСтрок >= ФТСБанкРоссииМОКоличествоСтрок,
		КонтролирующиеОрганыКоличествоСтрок, ФТСБанкРоссииМОКоличествоСтрок);
	ОсталосьСкрываемыхСтрок = ?(КонтролирующиеОрганыМаксимальноеКоличествоСтрок > КонтролирующиеОрганыКоличествоСтрок,
		КонтролирующиеОрганыМаксимальноеКоличествоСтрок - КонтролирующиеОрганыКоличествоСтрок, 0);
		
	Элементы.ОбменСФТС.Видимость = ЭлементНастроекОбмена.ПризнакПоддержкиФТС
		ИЛИ ЭлементНастроекОбмена.НастройкиОбменаФТС_ИспользоватьОбмен ИЛИ ОсталосьСкрываемыхСтрок = 0;
	ОбменСФТС = ?(ЭлементНастроекОбмена.ПризнакПоддержкиФТС
		ИЛИ ЭлементНастроекОбмена.НастройкиОбменаФТС_ИспользоватьОбмен,
		Новый ФорматированнаяСтрока(
		?(ЭлементНастроекОбмена.НастройкиОбменаФТС_ИспользоватьОбмен, НСтр("ru = 'Подключено'"), НСтр("ru = 'Не подключено'")),,
		?(ЭлементНастроекОбмена.НастройкиОбменаФТС_ИспользоватьОбмен, ЦветУспеха, ЦветНеактивного),,
		"ФТС"), " ");
	Если НЕ ЭлементНастроекОбмена.ПризнакПоддержкиФТС И НЕ ЭлементНастроекОбмена.НастройкиОбменаФТС_ИспользоватьОбмен
		И ОсталосьСкрываемыхСтрок > 0 Тогда
		ОсталосьСкрываемыхСтрок = ОсталосьСкрываемыхСтрок - 1;
	КонецЕсли;
	
	Элементы.ОбменСБанкомРоссии.Видимость = Результат.ПоддерживаетсяСдачаОтчетностиВЦБ
		ИЛИ ОсталосьСкрываемыхСтрок = 0;
		
	Текст = ?(ЭлементНастроекОбмена.ПредназначенаДляДокументооборотаСЦБ,
		НСтр("ru = 'Подключено'"), НСтр("ru = 'Не подключено'"));
		
	Цвет = ?(ЭлементНастроекОбмена.ПредназначенаДляДокументооборотаСЦБ, ЦветУспеха, ЦветНеактивного);
		
	ОбменСБанкомРоссии = ?(Результат.ПоддерживаетсяСдачаОтчетностиВЦБ, Новый ФорматированнаяСтрока(Текст,,Цвет,,"ЦБ"), " ");
		
	Если Результат.ПоддерживаетсяСдачаОтчетностиВЦБ Тогда
		
		Подсказка = НСтр("ru = 'Формы статистического наблюдения (1-ИЦБ, 1-АРЕНДА, 1-ПОЕЗДКИ, 1-РОУМИНГ, 1-ТРАНСПОРТ, 2-ТРАНСПОРТ, 3-ТРАНСПОРТ, 1-МЕД, 1-ПИ)'");
		ДокументооборотСКОКлиентСервер.ДобавитьПодсказку(Элементы.ОбменСБанкомРоссии, ОбменСБанкомРоссии, Подсказка);
		
	КонецЕсли;
		
	Если НЕ Результат.ПоддерживаетсяСдачаОтчетностиВЦБ И ОсталосьСкрываемыхСтрок > 0 Тогда
		ОсталосьСкрываемыхСтрок = ОсталосьСкрываемыхСтрок - 1;
	КонецЕсли;
	
	Элементы.ОбменСМинобороны.Видимость = Результат.ПоддерживаетсяСдачаОтчетностиВМинобороныРоссии
		ИЛИ ОсталосьСкрываемыхСтрок = 0;
	ОбменСМинобороны = ?(Результат.ПоддерживаетсяСдачаОтчетностиВМинобороныРоссии,
		Новый ФорматированнаяСтрока(
		?(ЭлементНастроекОбмена.НастройкиОбменаМинобороны_ИспользоватьОбмен, НСтр("ru = 'Подключено'"), НСтр("ru = 'Не подключено'")),,
		?(ЭлементНастроекОбмена.НастройкиОбменаМинобороны_ИспользоватьОбмен, ЦветУспеха, ЦветНеактивного),,
		"Минобороны"), " ");
	Если НЕ Результат.ПоддерживаетсяСдачаОтчетностиВМинобороныРоссии И ОсталосьСкрываемыхСтрок > 0 Тогда
		ОсталосьСкрываемыхСтрок = ОсталосьСкрываемыхСтрок - 1;
	КонецЕсли;
	
	Элементы.ГруппаОбменСФТСБанкомРоссииМО.Видимость = ЭлементНастроекОбмена.ПризнакПоддержкиФТС
		ИЛИ ЭлементНастроекОбмена.НастройкиОбменаФТС_ИспользоватьОбмен
		ИЛИ ЭлементНастроекОбмена.НастройкиОбменаМинобороны_ИспользоватьОбмен
		ИЛИ ЭлементНастроекОбмена.ПредназначенаДляДокументооборотаСЦБ;
	
	Элементы.ГруппаРазделительПрочихНастроек.Видимость = ПоддерживаетсяВторичноеЗаявление
		ИЛИ ЗначениеЗаполнено(ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_Ссылка);
	Элементы.ГруппаПрочиеНастройки.Видимость = ПоддерживаетсяВторичноеЗаявление
		ИЛИ ЗначениеЗаполнено(ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_Ссылка);
		
	ИзменитьОформлениеОбновитьССервера(ЭтотОбъект);
		
	Элементы.ЗаявлениеНаИзменение.Видимость 		= ПоддерживаетсяВторичноеЗаявление;
	Элементы.СписокЗаявлений.Видимость 				= ЗначениеЗаполнено(ЭлементНастроекОбмена.ЗаявлениеАбонентаСпецоператораСвязи_Ссылка);
	Элементы.РасширенныеНастройки.Видимость 		= ПоддерживаетсяВторичноеЗаявление;
	
	Элементы.СообщенияДляРасшифровкиДругимиПользователями.Видимость = ЭтоМультиРежим
		И ЗначениеЗаполнено(ЭлементНастроекОбмена.СертификатРуководителя);
	
	Если КриптографияЭДКОКлиентСервер.ЭтоПодписьСервиса(ЭлементНастроекОбмена)
		И ЗначениеЗаполнено(ЭлементНастроекОбмена.СертификатРуководителя)
		И ЭлементНастроекОбмена.СпособПодтвержденияКриптоопераций <> Неопределено
		И ДоступнаЭлектроннаяПодписьВМоделиСервиса Тогда
		
		ТекущийСпособ = ЭлементНастроекОбмена.СпособПодтвержденияКриптоопераций;
		СпособПодтвержденияКриптоопераций = СформироватьЗаголовокПодтвержденияСМС(ТекущийСпособ);
		Элементы.СпособПодтвержденияКриптоопераций.Видимость = Истина;
		Элементы.СпособПодтвержденияКриптоопераций.Подсказка =
			ЭлектроннаяПодписьВМоделиСервисаКлиентСервер.ПолучитьОписаниеСпособовПодтвержденияКриптоопераций();
		
	Иначе
		Элементы.СпособПодтвержденияКриптоопераций.Видимость = Ложь;
	КонецЕсли;
	
	Если ОповещениеОЗавершении <> Неопределено Тогда
		ВыполнитьОбработкуОповещения(ОповещениеОЗавершении, Результат.ТекущаяДатаНаСервере);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьСписокПользователей() Экспорт
	
	УчетнаяЗаписьДоступна = (ЭлементНастроекОбмена.ВидОбменаСКонтролирующимиОрганами =
		ПредопределенноеЗначение("Перечисление.ВидыОбменаСКонтролирующимиОрганами.ОбменВУниверсальномФормате")
		И ЗначениеЗаполнено(ЭлементНастроекОбмена.УчетнаяЗаписьОбмена)
		И ЭлементНастроекОбмена.ПравоЧтенияУчетнойЗаписиОбмена);
	
	СписокПользователейСтрокой = КонтекстЭДОКлиент.СписокПользователейСтрокой(
		ЭлементНастроекОбмена.СписокПользователей,
		УчетнаяЗаписьДоступна);
	
	ЦветСпискаПользователей = ЦветОшибки;
	Для каждого ЭлементСпискаПользователей Из ЭлементНастроекОбмена.СписокПользователей Цикл
		Если ЭлементСпискаПользователей.Пометка Тогда
			ЦветСпискаПользователей = Неопределено;
			Прервать;
		КонецЕсли;
	КонецЦикла;
	
	СписокПользователей = Новый ФорматированнаяСтрока(
		СписокПользователейСтрокой,,
		ЦветСпискаПользователей,,
		"Пользователи");
	
КонецПроцедуры
	
&НаКлиенте
Процедура СписокПользователейОбработкаНавигационнойСсылкиПослеПоказаСпискаПользователей(НовыйСписокПользователей, ДополнительныеПараметры) Экспорт
	
	Если КонтекстЭДОКлиент = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибкиИнициализацииКонтекстаЭДО);
		Возврат;
	КонецЕсли;
	
	Если ТипЗнч(НовыйСписокПользователей) <> Тип("СписокЗначений") Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьСписокПользователей();
	ЗаписатьПользователейНаСервере(НовыйСписокПользователей, ЭлементНастроекОбмена.УчетнаяЗаписьОбмена);
	ЭлементНастроекОбмена.СписокПользователей = НовыйСписокПользователей;
	Оповестить("Изменены пользователи учетной записи", ЭлементНастроекОбмена.УчетнаяЗаписьОбмена);
	
КонецПроцедуры

&НаСервереБезКонтекста
Процедура ЗаписатьПользователейНаСервере(НовыйСписокПользователей, УчетнаяЗапись)
	
	КонтекстЭДОСервер = ДокументооборотСКО.ПолучитьОбработкуЭДО();
	КонтекстЭДОСервер.ЗаписатьПользователейУчетнойЗаписиДокументооборота(НовыйСписокПользователей, УчетнаяЗапись);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаНавигационнойСсылкиПослеОбновленияНастроек(Результат, ДополнительныеПараметры) Экспорт
	
	ТипКонтролирующегоОргана 	= ДополнительныеПараметры.ТипКонтролирующегоОргана;
	
	ТекущаяДатаНаСервере = Результат;
	
	ОписаниеОповещения = Новый ОписаниеОповещения(
		"ОбработкаНавигационнойСсылкиПослеОбновленияНастроек_Завершение", 
		ЭтотОбъект);
	
	КонтекстЭДОКлиент.ОткрытьФормуПодключенияИлиНастройкиНаправленияСдачиОтчетности(
		ЭлементНастроекОбмена,
		ТипКонтролирующегоОргана,
		ТекущаяДатаНаСервере,
		ОписаниеОповещения);
	
КонецПроцедуры
	
&НаКлиенте
Процедура ОбработкаНавигационнойСсылкиПослеОбновленияНастроек_Завершение(Результат, ДополнительныеПараметры) Экспорт
	ОбновитьНастройкиОбменаОрганизации();
КонецПроцедуры	

&НаКлиенте
Процедура ВосстановлениеУчетнойЗаписиНажатиеПослеВыбора(Результат, ДополнительныеПараметры) Экспорт
	
	Если КонтекстЭДОКлиент = Неопределено Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстОшибкиИнициализацииКонтекстаЭДО);
		Возврат;
	КонецЕсли;
	
	Если Результат = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если Результат.Значение = ПредопределенноеЗначение("Перечисление.СпецоператорыСвязи.Такском") Тогда
		ОткрытьФорму(КонтекстЭДОКлиент.ПутьКОбъекту + ".Форма.РОКИМастерАвтонастройкиНовойУчетнойЗаписи");
	Иначе
		ОткрытьФорму(КонтекстЭДОКлиент.ПутьКОбъекту + ".Форма.ВосстановлениеУчетнойЗаписи");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Функция СформироватьЗаголовокПодтвержденияСМС(ТекущийРежим)
	
	КодЯзыка 		= "ru";
	ТекстЗаголовка	= ?(ТекущийРежим <> ПредопределенноеЗначение("Перечисление.СпособыПодтвержденияКриптоопераций.ДолговременныйТокен"), 
						НСтр("ru = 'Подтверждать'", КодЯзыка), 
						НСтр("ru = 'Не подтверждать'", КодЯзыка));
						
	Результат		= Новый ФорматированнаяСтрока(ТекстЗаголовка, , , , "СМС");
	
	Возврат Результат;
	
КонецФункции	

&НаКлиенте
Процедура ПослеИзмененияПодтвержденияСМС(РезультатВыбора, ДополнительныеПараметры = Неопределено) Экспорт
	
	Если РезультатВыбора <> Неопределено Тогда
		СпособПодтвержденияКриптоопераций = СформироватьЗаголовокПодтвержденияСМС(РезультатВыбора.СпособПодтвержденияКриптоопераций);
	КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура НастроитьАвтоматическиСейчасНажатиеПослеАвтонастройки(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Свойство("РезультатНастройки") Тогда
		РезультатНастройки = Результат.РезультатНастройки;
	ИначеЕсли Результат.Свойство("РезультатПрименения") Тогда
		РезультатНастройки = Результат.РезультатПрименения;
	Иначе
		РезультатНастройки = Неопределено;
	КонецЕсли;
	
	Если РезультатНастройки = Истина Тогда
		ОбновитьНастройкиОбменаОрганизации();
		ПоказатьПредупреждение(, НСтр("ru = 'Обновление настроек успешно завершено.'"));
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ИнициализироватьМультирежим()
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если ЭлементНастроекОбмена = Неопределено Тогда
		УчетнаяЗапись = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Организация, "УчетнаяЗаписьОбмена");
	Иначе
		УчетнаяЗапись = ЭлементНастроекОбмена.УчетнаяЗаписьОбмена;
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(УчетнаяЗапись) Тогда
		Возврат;
	КонецЕсли;
	
	Мультирежим.ИнициализироватьМультирежимНеИзЗаявления(
		ЭтотОбъект,
		УчетнаяЗапись);
	
	ВладелецЭЦПЭтоАдмин = Ложь;
	Если ЭтоМультиРежим Тогда
		ЭтоЮридическоеЛицо = РегламентированнаяОтчетностьВызовСервера.ЭтоЮридическоеЛицо(Организация);
		Руководитель = ЭлектронныйДокументооборотСКонтролирующимиОрганамиВызовСервераПереопределяемый.Руководитель(
			Организация);
		Строка = МультирежимКлиентСервер.СтрокаТаблицыПользователей(ЭтотОбъект, ТекущийПользователь);
		ВладелецЭЦПЭтоАдмин = ?(Строка = Неопределено, Ложь, Строка.ЭтоАдмин);
		
		ВыбранныйПользователь = ?(ЗначениеЗаполнено(ОтборПоПользователю) ИЛИ ВладелецЭЦПЭтоАдмин,
			ОтборПоПользователю, Пользователи.ТекущийПользователь());
		
		СписокВыбора = Элементы.ОтборПоПользователю.СписокВыбора;
		
		СписокВыбора.Очистить();
		Для каждого Строка Из ТаблицаПользователей Цикл
			Представление = Мультирежим.ПредставлениеПользователей(ЭтотОбъект, Строка);
			СписокВыбора.Добавить(Строка.Пользователь, Представление);
		КонецЦикла;
		СписокВыбора.СортироватьПоПредставлению(НаправлениеСортировки.Возр);
		СписокВыбора.Вставить(0, Справочники.Пользователи.ПустаяСсылка(), НСтр("ru = 'Гос. органы учетной записи'"));
		
		ОтборПоПользователю = ВыбранныйПользователь;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ПараметрыФормыПользователи() Экспорт
	
	УчетнаяЗапись = ЭлементНастроекОбмена.УчетнаяЗаписьОбмена;
	Возврат Мультирежим.ПараметрыФормыПользователиНеИзЗаявления(ЭтотОбъект, УчетнаяЗапись);
	
КонецФункции

&НаКлиентеНаСервереБезКонтекста
Функция УчетнаяЗаписьДоступна(Форма)
	
	Возврат 
		ЗначениеЗаполнено(Форма.ЭлементНастроекОбмена)
		И Форма.ЭлементНастроекОбмена.ВидОбменаСКонтролирующимиОрганами =
		ПредопределенноеЗначение("Перечисление.ВидыОбменаСКонтролирующимиОрганами.ОбменВУниверсальномФормате")
		И ЗначениеЗаполнено(Форма.ЭлементНастроекОбмена.УчетнаяЗаписьОбмена)
		И Форма.ЭлементНастроекОбмена.ПравоЧтенияУчетнойЗаписиОбмена;
		
КонецФункции

&НаСервере
Функция ПараметрыФормыПравПользователя() Экспорт
	
	ПараметрыФормы = Мультирежим.ШаблонПараметровФормыПравПользователя();
	
	Строка = МультирежимКлиентСервер.СтрокаТаблицыПользователей(ЭтотОбъект, ТекущийПользователь, Истина);
	
	Результат = Новый Структура(ПараметрыФормы);
	Результат.ВладелецЭЦПЭтоАдмин = Строка.ЭтоАдмин;
	Результат.Организация = Организация;
	Результат.ТекущийПользователь = ТекущийПользователь;
	Результат.ЗапретитьИзменение = Истина;
	Результат.ВладелецЭЦПРасширилСебеПрава = Ложь;
	Результат.ЭтоМультиРежим = Истина;
	Результат.ЭтоМультиРежимИсходный = Истина;
	Результат.ВладелецЭЦПСНИЛС = Строка.СНИЛС;
	Результат.ВладелецЭЦП = Строка.ФизическоеЛицо;
	Результат.УчетнаяЗапись = ЭлементНастроекОбмена.УчетнаяЗаписьОбмена;
	
	Результат.Вставить("ПараметрыФормы", ПараметрыФормы);
	
	Результат.Вставить("АдресТаблицы", Мультирежим.АдресТаблицы(ЭтотОбъект, "ТаблицаПользователей"));
	Результат.Вставить("ВсеГосОрганыУчетнойЗаписи", Мультирежим.ВсеГосОрганыУчетнойЗаписи(ЭтотОбъект));
	
	Возврат Результат;
	
КонецФункции

&НаСервере
Функция ОформлениеПравПользователей() Экспорт
	
	Возврат Мультирежим.ОформлениеПравПользователей(ЭтотОбъект);
	
КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере_85()
	
	ДокументооборотСКО.УбратьДвоеточияЗаголовков_85(ЭтотОбъект, Истина);
	
	ИзменитьОформлениеОбновитьССервера(ЭтотОбъект);
	
	Если НЕ ДокументооборотСКОКлиентСервер.ЭтоИнтерфейс85() Тогда
		Элементы.ГруппаШапка.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура ИзменитьОформлениеОбновитьССервера(Форма, Скрыть = Ложь)
	
	Элементы = Форма.Элементы;
	
	Видимость = УчетнаяЗаписьДоступна(Форма)
		И ЗначениеЗаполнено(Форма.ЭлементНастроекОбмена.СпецоператорСвязи)
		И Форма.ЭлементНастроекОбмена.СпецоператорСвязи <> ПредопределенноеЗначение("Перечисление.СпецоператорыСвязи.Прочие");
	
	ЭтоИнтерфейс85 = ДокументооборотСКОКлиентСервер.ЭтоИнтерфейс85();
	
	Элементы.ОбновитьССервераТакси.Видимость = Видимость И НЕ ЭтоИнтерфейс85 И НЕ Скрыть;
	Элементы.ОбновитьССервера.Видимость = Видимость И ЭтоИнтерфейс85 И НЕ Скрыть;
	
КонецПроцедуры

&НаКлиенте
Функция УстановитьЗаголовокОбменаСПФР(Состояние, ЦветУспеха = Неопределено, ЦветОшибки = Неопределено) Экспорт // В настройках
	
	ПараметрыОткрытия = КонтекстЭДОКлиент.ПараметрыОткрытияПредложенияОтправитьЗаявлениеВПФРИзНастроекИлиПриОтправке(Состояние, Ложь);

	Подсказка = "";
	Если Состояние.НаОтключение.ОрганизацияОтключена Тогда
		
		Оранжевый = Новый Цвет(255, 128, 0);
		ЗаголовокСсылки = Новый ФорматированнаяСтрока(НСтр("ru = 'Подключено (ЭТК откл.)'"),,Оранжевый,,"ПФР");
		Подсказка = НСтр("ru = 'Использование электронных трудовых книжек отключено.'");
		
	ИначеЕсли ПараметрыОткрытия.НужноОтправитьЗаявление Тогда
			
		Красный = ?(ЦветОшибки = Неопределено, Новый Цвет(225, 40, 40), ЦветОшибки);
		ЗаголовокСсылки = Новый ФорматированнаяСтрока(НСтр("ru = 'Не отправлено заявление в СФР'"),,Красный,,"ПФР");
		Подсказка = ДокументооборотСКОКлиентСервер.ПодсказкаКЗаявлениюНаПодключениеПФР();
		
	ИначеЕсли ПараметрыОткрытия.ПредупредитьОНеодобренном Тогда
		
		Вид       = Состояние.Неодобренное.Вид;
		Оранжевый = Новый Цвет(255, 128, 0);
		
		Если Вид = ПредопределенноеЗначение("Перечисление.ВидыЗаявленийНаЭДОВПФР.НаПодключение") Тогда
			ЗаголовокСсылки = Новый ФорматированнаяСтрока(НСтр("ru = 'Рассматривается заявление на подключение'"),,Оранжевый,,"ПФР");
			Подсказка = ДокументооборотСКОКлиентСервер.ПодсказкаКЗаявлениюНаПодключениеПФР();
		ИначеЕсли Вид = ПредопределенноеЗначение("Перечисление.ВидыЗаявленийНаЭДОВПФР.НаОтключение") Тогда
			ЗаголовокСсылки = Новый ФорматированнаяСтрока(НСтр("ru = 'Рассматривается заявление на отключение'"),,Оранжевый,,"ПФР");
			Подсказка = ДокументооборотСКОКлиентСервер.ПодсказкаКЗаявлениюНаОтключениеПФР();
		КонецЕсли;
		
	Иначе
		
		Зеленый = ?(ЦветУспеха = Неопределено, Новый Цвет(100, 176, 16), ЦветУспеха);
		ЗаголовокСсылки = Новый ФорматированнаяСтрока(НСтр("ru = 'Подключено'"),,Зеленый,,"ПФР");
		
	КонецЕсли;
	
	ОбменСПФР = ЗаголовокСсылки;
	
	ДокументооборотСКОКлиентСервер.ДобавитьПодсказку(Элементы.ОбменСПФР, ОбменСПФР, Подсказка);
	
КонецФункции
	
&НаКлиенте
Процедура ГосОрганНажатие(СтандартнаяОбработка, ГосОрган)

	СтандартнаяОбработка = Ложь;
	
	ДополнительныеПараметры = Новый Структура("ТипКонтролирующегоОргана", ГосОрган);
	ОписаниеОповещения = Новый ОписаниеОповещения("ОбработкаНавигационнойСсылкиПослеОбновленияНастроек",
		ЭтотОбъект, ДополнительныеПараметры);
	ОбновитьНастройкиОбменаОрганизации(ОписаниеОповещения);

КонецПроцедуры


#КонецОбласти
